package com.example.kinoposik.models

object MovieLinks {
    val linksOfComedy = listOf<Movie>(
        Movie(
            "Один дома (1990)",
            "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/82af3f64-2908-4684-be9e-f60eaff3281d/300x450",
            "Мальчик-озорник задает жару грабителям. Лучшая комедия для создания праздничного настроения у всей семьи"
        ),
        Movie(
            "Круэлла (2021)",
            "https://avatars.mds.yandex.net/get-kinopoisk-image/4303601/13c3de4d-2cc5-4774-a3b9-195b382e6d11/300x450",
            "Бунтарка покоряет модный мир Лондона. Предыстория злодейки из «101 далматинца» с «Оскаром» за костюмы"
        ),
        Movie(
            "Мальчишник в Вегасе (2009)",
            "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/cdd49af8-7ba4-42ee-9f92-10ba7e3d021b/300x450",
            "Они мечтали устроить незабываемый мальчишник в Вегасе. Но теперь им необходимо вспомнить, что именно произошло: что за ребенок сидит в шкафу номера отеля? Как в ванную попал тигр? Почему у одного из них нет зуба? И, самое главное, куда делся жених? То, что парни вытворяли на вечеринке, не идет ни в какое сравнение с тем, что им придется сделать на трезвую голову, когда они будут шаг за шагом восстанавливать события прошлой ночи."
        ),
        Movie(
            "Всегда говори «ДА» (2008)",
            "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/a4bcd57c-d63d-4d2c-944d-78bbf78d3a09/300x450",
            "Депрессивный главный герой всегда и всем говорил «нет» — например, друзьям, если они зовут куда-то. Но в один прекрасный день он заключает соглашение, по которому всегда должен отвечать «Да» на любое предложение..."
        ),
        Movie(
            "Маска (1994)",
            "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/af924598-65b8-47c5-8297-75a661a7c335/300x450",
            "Скромный и застенчивый служащий банка чувствует себя неуверенно с красивыми девушками и вообще рядом с людьми. Волей судьбы к нему попадает волшебная маска, и Стенли Ипкис приобретает способность превращаться в неуязвимое мультяшное существо с озорным характером."
        ), Movie(
            "Лулу и Бриггс (2021)",
            "https://avatars.mds.yandex.net/get-kinopoisk-image/1898899/c456643c-84fc-4b24-a288-668e3afa95fc/300x450",
            "Профессиональный военный Джексон Бриггс всеми силами пытается вернуться в строй, но из-за травмы головы получает постоянные отказы. Когда умирает один из его сослуживцев, Бриггсу дают задание: с военной базы в штате Вашингтон доставить на похороны в аризонский Ногалес боевую подругу почившего — нервную бельгийскую овчарку Лулу с целым спектром посттравматических расстройств. Поскольку собака боится летать, сделать это придётся на машине по Тихоокеанскому побережью, и эта поездка будет не самым простым заданием Бриггса."
        )
    )

    val linksOfCriminal = listOf(
        Movie(
            "Джентльмены (2019)",
            "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/637271d5-61b4-4e46-ac83-6d07494c7645/300x450",
            "Один ушлый американец ещё со студенческих лет приторговывал наркотиками, а теперь придумал схему нелегального обогащения с использованием поместий обедневшей английской аристократии и очень неплохо на этом разбогател. Другой пронырливый журналист приходит к Рэю, правой руке американца, и предлагает тому купить киносценарий, в котором подробно описаны преступления его босса при участии других представителей лондонского криминального мира — партнёра-еврея, китайской диаспоры, чернокожих спортсменов и даже русского олигарха."
        ),
        Movie(
            "Криминальное чтиво (1994)",
            "https://avatars.mds.yandex.net/get-kinopoisk-image/1900788/87b5659d-a159-4224-9bff-d5a5d109a53b/300x450",
            "Двое бандитов Винсент Вега и Джулс Винфилд ведут философские беседы в перерывах между разборками и решением проблем с должниками криминального босса Марселласа Уоллеса.В первой истории Винсент проводит незабываемый вечер с женой Марселласа Мией. Во второй рассказывается о боксёре Бутче Кулидже, купленном Уоллесом, чтобы сдать бой. В третьей истории Винсент и Джулс по нелепой случайности попадают в неприятности."
        )
    )

    val linksOfAction = listOf(
        Movie(
            "Шерлок Холмс (2009)",
            "https://avatars.mds.yandex.net/get-kinopoisk-image/1777765/244e2847-f426-4c60-86ba-34cde7db695f/300x450",
            "Величайший в истории сыщик Шерлок Холмс вместе со своим верным соратником Ватсоном вступают в схватку, требующую нешуточной физической и умственной подготовки, ведь их враг представляет угрозу для всего Лондона."
        ),
        Movie(
            "Бесславные ублюдки (2009)",
            "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/5e6dde98-74a8-4c02-b003-01d48e091025/300x450",
            "Вторая мировая война, в оккупированной немцами Франции группа американских солдат-евреев наводит страх на нацистов, жестоко убивая и скальпируя солдат."
        )
    )

    val linksOfArmy = listOf<Movie>(
        Movie(
            "1917 (2019)",
            "https://static.okko.tv/images/v2/16253974?scale=1&quality=80",
            "6 апреля 1917 года, разгар Первой мировой войны, Западный фронт на севере Франции. Британский генерал поручает капралу Блэйку и его сослуживцу смертельно опасную миссию. Они должны пересечь вражескую территорию, вроде бы оставленную германскими войсками, и доставить приказ об отмене наступления во 2-й батальон Девонширского полка, иначе 1600 солдат попадут в ловушку противника, в том числе и брат Блэйка."
        ), Movie(
            "Чёрный ястреб (2001)",
            "https://avatars.mds.yandex.net/get-kinopoisk-image/1600647/59a72eaa-3bf3-448b-8da4-5d5ed7375df8/300x450",
            "Сомали, 1993 год. Страна вымирает от голода, число жертв превысило триста тысяч человек. Миротворческие силы ООН пытаются восстановить порядок и организовать поставки продовольствия. В помощь им Вашингтон выслал полтысячи человек из элитных подразделений американской армии, знаменитые отряды «Дельта» и армейских рейнджеров.В городе Могадишо хозяйничает и творит беспредел полевой командир Айдид, убивая мирных граждан и отбирая гуманитарную помощь. В определенный момент орлы из Вашингтона решают провести операцию по захвату Айдида в его резиденции.Молодой офицер, только что назначенный взводным; матерый сержант, ведущий колонну машин; казарменный писарь, не нюхавший пороху; экипажи сбитых вертолетов, вынужденных ждать подкрепления и эвакуации; двое солдат, которых забыли взять с собой при смене позиции; генерал, сидящий в штабе и наблюдающий через спутниковую связь, как погибают его солдаты."
        )
    )

    val linksOfDrama = listOf<Movie>(
        Movie("Игры разума (2001)","https://avatars.mds.yandex.net/get-kinopoisk-image/4303601/80f21137-eebb-4cdc-8124-96c68c07c2a8/300x450","От всемирной известности до греховных глубин — все это познал на своей шкуре Джон Форбс Нэш-младший. Математический гений, он на заре своей карьеры сделал титаническую работу в области теории игр, которая перевернула этот раздел математики и практически принесла ему международную известность.Однако буквально в то же время заносчивый и пользующийся успехом у женщин Нэш получает удар судьбы, который переворачивает уже его собственную жизнь."),
    Movie("Волк с Уолл-стрит (2013)","https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/5c758ac0-7a5c-4f00-a94f-1be680a312fb/300x450","1987 год. Джордан Белфорт становится брокером в успешном инвестиционном банке. Вскоре банк закрывается после внезапного обвала индекса Доу-Джонса. По совету жены Терезы Джордан устраивается в небольшое заведение, занимающееся мелкими акциями. Его настойчивый стиль общения с клиентами и врождённая харизма быстро даёт свои плоды. Он знакомится с соседом по дому Донни, торговцем, который сразу находит общий язык с Джорданом и решает открыть с ним собственную фирму. В качестве сотрудников они нанимают нескольких друзей Белфорта, его отца Макса и называют компанию «Стрэттон Оукмонт». В свободное от работы время Джордан прожигает жизнь: лавирует от одной вечеринки к другой, вступает в сексуальные отношения с проститутками, употребляет множество наркотических препаратов, в том числе кокаин и кваалюд. Однажды наступает момент, когда быстрым обогащением Белфорта начинает интересоваться агент ФБР...")
    )

    val linksOfMelodrama = listOf<Movie>(Movie("Стажёр (2015)","https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/8c7b4d5f-2f53-4a37-85bc-dc8bdd5c89c2/300x450","70-летний вдовец Бен Уитакер обнаруживает, что выход на пенсию — еще не конец. Пользуясь случаем, он становится старшим стажером в интернет-магазине модной одежды под руководством Джулс Остин."), Movie("Знакомьтесь, Джо Блэк (1998)","https://avatars.mds.yandex.net/get-kinopoisk-image/4774061/a7dabae7-43a1-4702-aa22-c9faaadee54d/300x450","В жизни богатого и влиятельного газетного магната Уильяма Пэрриша появляется сама Смерть, принявшая обличье обворожительного молодого человека по имени Джо Блэк.Смерть, уставшая от своих привычных обязанностей,предлагает Пэрришу необычное соглашение: магнат станет проводником Джо в мире живых, где тот планирует провести свой отпуск. По окончании каникул Смерть заберет Пэрриша с собой. С помощью Уильяма, загадочный и эксцентричный Джо начинает свое путешествие по бренной Земле.Но происходит непредвиденное. Оказывается, что тело погибшего мужчины, которое Смерть выбрала для себя, принадлежало юноше, в которого была влюблена дочь Пэрриша."))

    val linksOfCartoon = listOf<Movie>(Movie("Как приручить дракона (2010)","https://avatars.mds.yandex.net/get-kinopoisk-image/4774061/1a920451-e765-41e9-81aa-78438e82abbc/300x450","Вы узнаете историю подростка Иккинга, которому не слишком близки традиции его героического племени, много лет ведущего войну с драконами. Мир Иккинга переворачивается с ног на голову, когда он неожиданно встречает дракона Беззубика, который поможет ему и другим викингам увидеть привычный мир с совершенно другой стороны…"), Movie("Холодное сердце (2013)","https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/efa923ca-2007-4a79-b759-377fc1a5664f/300x450","Когда сбывается древнее предсказание, и королевство погружается в объятия вечной зимы, трое бесстрашных героев - принцесса Анна, отважный Кристофф и его верный олень Свен - отправляются в горы, чтобы найти сестру Анны, Эльзу, которая может снять со страны леденящее заклятие. По пути их ждет множество увлекательных сюрпризов и захватывающих приключений: встреча с мистическими троллями, знакомство с очаровательным снеговиком по имени Олаф, горные вершины покруче Эвереста и магия в каждой снежинке. Анне и Кристоффу предстоит сплотиться и противостоять могучей стихии, чтобы спасти королевство и тех, кто им дорог."))

    val movieCategory = listOf<MovieCategory>(
        MovieCategory("Комедии", linksOfComedy),
        MovieCategory("Криминал", linksOfCriminal),
        MovieCategory("Боевики", linksOfAction),
        MovieCategory("Военные", linksOfArmy),
        MovieCategory("Драмы", linksOfDrama),
        MovieCategory("Мелодрамы", linksOfMelodrama),
        MovieCategory("Мультфильмы", linksOfCartoon)
    )

}