package com.example.kinoposik

import com.example.kinoposik.models.Movie
import com.example.kinoposik.models.MovieCategory

val comedy = mutableListOf(
    Movie(
        "Зависнуть в Палм-Спрингс",
        "https://upload.wikimedia.org/wikipedia/ru/4/4c/Kinopoisk.ru-Palm-Springs-3537107.jpg",
        "9 ноября неподалёку от Палм-Спрингс идёт подготовка к свадьбе. Найлз, парень одной из подружек невесты, не торопится облачаться в смокинг — в шортах и гавайской рубашке он запрыгивает в бассейн и целый день расслабленно выпивает, а вечером произносит трогательную речь для молодожёнов. Последнее особенно впечатляет старшую сестру невесты Сару, и вот уже девушка оказывается с Найлзом наедине под звёздным небом. Но тут события принимают неожиданный поворот, и Сара вслед за своим новым приятелем заходит в загадочную пещеру, а на следующий день обнаруживает, что на календаре снова 9 ноября"
    ),
    Movie(
        "Реальные упыри",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1704946/76d373e2-54ae-4755-a543-0ff633948003/600x900",
        "История жизни Виаго, Дикона и Владислава — трёх соседей и по совместительству бессмертных вампиров, которые всего лишь пытаются выжить в современном мире, где есть арендная плата, фейсконтроль в ночных клубах, губительный солнечный свет и другие неприятности"
    ),
    Movie(
        "Всегда говори «ДА»",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/a4bcd57c-d63d-4d2c-944d-78bbf78d3a09/600x900",
        "Депрессивный главный герой всегда и всем говорил «нет» — например, друзьям, если они зовут куда-то. Но в один прекрасный день он заключает соглашение, по которому всегда должен отвечать «Да» на любое предложение..."
    ),
    Movie(
        "Лулу и Бриггс",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1898899/c456643c-84fc-4b24-a288-668e3afa95fc/600x900",
        "Профессиональный военный Джексон Бриггс всеми силами пытается вернуться в строй, но из-за травмы головы получает постоянные отказы. Когда умирает один из его сослуживцев, Бриггсу дают задание: с военной базы в штате Вашингтон доставить на похороны в аризонский Ногалес боевую подругу почившего — нервную бельгийскую овчарку Лулу с целым спектром посттравматических расстройств. Поскольку собака боится летать, сделать это придётся на машине по Тихоокеанскому побережью, и эта поездка будет не самым простым заданием Бриггса"
    ),
    Movie(
        "Мы — Миллеры",
        "https://upload.wikimedia.org/wikipedia/ru/8/8a/We%27re_the_Millers.jpeg",
        "Дэвид Кларк — мелкий торговец наркотиками. Среди его клиентов — повара и скучающие домохозяйки. Детям он наркотики не продаёт и поэтому считает себя принципиальным человеком. Дэвид действительно хорошо относится к детям, но это не остается безнаказанным — он пытается помочь подросткам, попавшим в беду, и на него нападают хулиганы-панки. Они отбирают у него наркотики и деньги, и наш герой оказывается в отчаянном положении. Ведь ему нечем расплатиться с его поставщиком Брэдом. Единственный выход — подрядиться на доставку крупной партии наркотиков через границу…"
    ),
    Movie(
        "Большой Лебовски",
        "https://b1.filmpro.ru/c/411817.jpg",
        "Лос-Анджелес, 1991 год, война в Персидском заливе. Главный герой по прозвищу Чувак считает себя совершенно счастливым человеком. Его жизнь составляют игра в боулинг и выпивка. Но внезапно его счастье нарушается, гангстеры по ошибке принимают его за миллионера-однофамильца, требуют деньги, о которых он ничего не подозревает, и, ко всему прочему, похищают жену миллионера, будучи уверенными, что «муж» выплатит за нее любую сумму"
    ),
    Movie(
        "Евротур",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/4303601/56f432e5-9344-4bbe-b6b7-a975ed6939b2/300x450",
        "Выпускнику школы Скотту Томасу нужна помощь в изучении немецкого языка, поэтому он знакомится с жителем Германии по имени Майк и начинает с ним дружескую переписку. Причём Скотт абсолютно уверен, что Майк — это парень, и делится с ним своими переживаниями и проблемами, которые возникают у него с девушкой. Но в конце концов Скотт узнаёт, что Майк, точнее Мике — это обворожительная блондинка, которой Скотт очень понравился. И теперь он сделает всё, чтобы увидеться с Мике, даже совершит путешествие по Европе"
    )
)

val drama = mutableListOf(
    Movie(
        "1+1",
        "https://upload.wikimedia.org/wikipedia/ru/b/b9/Intouchables.jpg",
        "Пострадав в результате несчастного случая, богатый аристократ Филипп нанимает в помощники человека, который менее всего подходит для этой работы, – молодого жителя предместья Дрисса, только что освободившегося из тюрьмы. Несмотря на то, что Филипп прикован к инвалидному креслу, Дриссу удается привнести в размеренную жизнь аристократа дух приключений"
    ),
    Movie(
        "Джокер",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/84934543-5991-4c93-97eb-beb6186a3ad7/600x900",
        "Готэм, начало 1980-х годов. Комик Артур Флек живет с больной матерью, которая с детства учит его «ходить с улыбкой». Пытаясь нести в мир хорошее и дарить людям радость, Артур сталкивается с человеческой жестокостью и постепенно приходит к выводу, что этот мир получит от него не добрую улыбку, а ухмылку злодея Джокера"
    ),
    Movie(
        "Хатико: Самый верный друг",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1629390/82f8a2dc-a439-4832-9f0f-dc599e6e78d2/600x900",
        "В основе сюжета - реальная история, случившаяся в Японии и потрясшая весь мир. Однажды, возвращаясь с работы, профессор колледжа нашел на вокзале симпатичного щенка породы акита-ину. Профессор и Хатико стали верными друзьями. Каждый день пес провожал и встречал Профессора на вокзале. И даже потеря хозяина не остановила пса в его надежде, что друг вернется"
    ),
    Movie(
        "Загадочная история Бенджамина Баттона",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1704946/6ffcf4e6-d512-4eac-a404-7344f5371255/600x900",
        "Фильм о мужчине, который родился в возрасте 80 лет, а затем… начал молодеть. Этот человек, как и каждый из нас, не мог остановить время. Его путь в ХХI век, берущий свое начало в Новом Орлеане в 1918 году в самом конце Первой Мировой войны, будет столь необычен, что вряд ли мог иметь место в жизни кого-либо другого. Фильм повествует о судьбе уникального человека, о людях и событиях, что ждут его впереди, о любви, которую он обретет и потеряет, о радостях жизни и грусти потерь и о том, что остается с нами вне времени"
    ),
    Movie(
        "Шоу Трумана",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/4483445/ceb4574e-4b3b-43bf-a217-770d95c8afea/300x450",
        "Представьте себе, что вы вдруг начинаете понимать, что все вокруг вас — декорации, а люди — актеры, притворяющиеся теми, кем они вам кажутся. Весь ваш мир оказывается большим телесериалом, где вы исполняете главную роль, даже не подозревая об этом. Вся ваша жизнь — результат работы автора телешоу, которое вот уже тридцать лет смотрит вся планета, начиная с момента вашего рождения.\n" +
                "В такой ситуации оказался Труман, главный герой картины. Будет ли он продолжать жить в безопасном мире, где, как он теперь знает, у него практически нет свободы выбора, или все-таки выйдет из «игры» и станет сам хозяином своей судьбы, в которой его ждет не запланированная сценарием девушка?"
    ),
    Movie(
        "Паразиты",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/4303601/aae3a928-6465-4bed-9af4-16929a44fd79/600x900",
        "Обычное корейское семейство Кимов жизнь не балует. Приходится жить в сыром грязном полуподвале, воровать интернет у соседей и перебиваться случайными подработками. Однажды друг сына семейства, уезжая на стажировку за границу, предлагает тому заменить его и поработать репетитором у старшеклассницы в богатой семье Пак. Подделав диплом о высшем образовании, парень отправляется в шикарный дизайнерский особняк и производит на хозяйку дома хорошее впечатление. Тут же ему в голову приходит необычный план по трудоустройству сестры"
    ),
    Movie(
        "Семь жизней",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/4774061/4c34cc44-cf15-451d-b878-8efc2c624b58/300x450",
        "Инженер Бен отправляется в необычное путешествие. В ходе своей поездки он встречает семерых незнакомцев, включая смертельно больную Эмили, которая называет себя девушкой с подбитыми крыльями. Бен неожиданно влюбляется в нее, что сильно усложняет его первоначальный план. Сможет ли он разгадать послание судьбы?"
    )
)

val anime = mutableListOf(
    Movie(
        "Унесённые призраками",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/ae3b699c-3db7-4196-a869-39b610bfe706/600x900",
        "Тихиро с мамой и папой переезжает в новый дом. Заблудившись по дороге, они оказываются в странном пустынном городе, где их ждет великолепный пир. Родители с жадностью набрасываются на еду и к ужасу девочки превращаются в свиней, став пленниками злой колдуньи Юбабы. Теперь, оказавшись одна среди волшебных существ и загадочных видений, Тихиро должна придумать, как избавить своих родителей от чар коварной старухи"
    ),
    Movie(
        "Ходячий замок",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/399bb0c1-2ac5-46ca-9efd-50d8708e2809/600x900",
        "Злая ведьма заточила 18-летнюю Софи в тело старухи. Девушка-бабушка бежит из города куда глаза глядят и встречает удивительный дом на ножках, где знакомится с могущественным волшебником Хаулом и демоном Кальцифером. Кальцифер должен служить Хаулу по договору, условия которого он не может разглашать. Девушка и демон решают помочь друг другу избавиться от злых чар"
    ),
    Movie(
        "Твоё имя",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/e849937d-99d7-418f-bbaa-0a7e7cfff385/600x900",
        "Токийский парень Таки и провинциальная девушка Мицуха обнаруживают, что между ними существует странная связь. Во сне они меняются телами и проживают жизни друг друга. Но однажды эта способность исчезает так же внезапно, как появилась. Таки решает во что бы то ни стало отыскать Мицуху"
    ),
    Movie(
        "Форма голоса",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1900788/dedeffc1-445f-46aa-b9a4-0afa0d36f3a3/300x450",
        "Молодой человек Сёя Исида внезапно осознаёт, что в школе умудрился превратить жизнь одноклассницы Сёко в ад только потому, что та была глухая. И теперь, хоть и запоздало, парень понял — чтобы сказать нечто важное тому, кто не может тебя услышать, вовсе не обязательно использовать голос"
    ),
    Movie(
        "Девочка, покорившая время",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1704946/d3227751-0c49-4aa6-9708-05e875b215f3/300x450",
        "17-летняя Макото Конно не слишком хорошо учится, часто опаздывает и не знает, кем хочет стать после окончания школы. По вечерам она играет с друзьями в бейсбол, каждое утро вскакивает на велосипед и торопится в школу. Но внезапно в её привычной размеренной жизни случается странное событие, после чего Макото обретает способность перемещаться во времени"
    ),
    Movie(
        "Укрась прощальное утро цветами обещания",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/551571aa-2c50-41b2-9ffb-51878e443054/600x900",
        "Красавица Макия — из рода бессмертных. На протяжении веков многие армии пытались захватить её народ, чтобы завладеть секретом вечной жизни. И вот теперь, когда город разрушен, девушка прячется в лесу. Здесь она находит потерявшего родителей маленького мальчика Эриала и начинает о нём заботиться"
    ),
    Movie(
        "Ученик чудовища",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1773646/1fe30dde-2f51-4079-af04-7aca9f171064/600x900",
        "9-летний мальчик Рэн остался без родителей, сбежал от опекунов и скитался по улицам Токио. Там он встречает великого воина Медвежута — похожее на медведя чудище, явившееся из параллельного мира, чтобы найти себе ученика. Им и становится Рэн. В мире чудовищ мальчик получает имя Девята и под началом Медвежута начинает тренировки, чтобы стать мастером боевых искусств"
    )
)

val mults = mutableListOf(
    Movie(
        "Зверополис",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/4716873/893bba73-3105-4944-8d18-a38f929f2759/600x900",
        "Добро пожаловать в Зверополис – современный город, населенный самыми разными животными, от огромных слонов до крошечных мышек. Зверополис разделен на районы, полностью повторяющие естественную среду обитания разных жителей – здесь есть и элитный район Площадь Сахары и неприветливый Тундратаун. В этом городе появляется новый офицер полиции, жизнерадостная зайчиха Джуди Хоппс, которая с первых дней работы понимает, как сложно быть маленькой и пушистой среди больших и сильных полицейских. Джуди хватается за первую же возможность проявить себя, несмотря на то, что ее партнером будет болтливый хитрый лис Ник Уайлд. Вдвоем им предстоит раскрыть сложное дело, от которого будет зависеть судьба всех обитателей Зверополиса"
    ),
    Movie(
        "Король Лев",
        "https://upload.wikimedia.org/wikipedia/ru/6/62/Lion_king_ver1.jpg",
        "У величественного Короля-Льва Муфасы рождается наследник по имени Симба. Уже в детстве любознательный малыш становится жертвой интриг своего завистливого дяди Шрама, мечтающего о власти.\n" +
                "Симба познаёт горе утраты, предательство и изгнание, но в конце концов обретает верных друзей и находит любимую. Закалённый испытаниями, он в нелёгкой борьбе отвоёвывает своё законное место в «Круге жизни», осознав, что значит быть настоящим Королём"
    ),
    Movie(
        "Рататуй",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1773646/894f7e3c-cedf-4e5c-946a-9021efdf17dd/300x450",
        "Крыс Реми обладает уникальным вкусом. Он готов рисковать собственной жизнью, чтобы посмотреть любимое кулинарное шоу и раздобыть какую-нибудь приправку или просто свежий продукт. Реми живет со своими сородичами, которые его не понимают и не принимают его увлечения кулинарией. Когда Реми случайно попадает на кухню шикарного ресторана, он решает воспользоваться выпавшим ему шансом и проверить свои навыки.\n" +
                "\n" +
                "На эту же кухню попадает и юный Лингвини. Всё, на что он может рассчитывать — это должность уборщика. Но он тоже получает свой шанс"
    ),
    Movie(
        "ВАЛЛ·И",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/146b1b20-347b-4b6a-98c8-fdc2c75495cb/300x450",
        "Робот ВАЛЛ·И из года в год прилежно трудится на опустевшей Земле, очищая нашу планету от гор мусора, которые оставили после себя улетевшие в космос люди. Он и не представляет, что совсем скоро произойдут невероятные события, благодаря которым он встретит друзей, поднимется к звездам и даже сумеет изменить к лучшему своих бывших хозяев, совсем позабывших родную Землю"
    ),
    Movie(
        "Шрэк",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/7ade06a8-4178-4386-9ee2-87fec5a172eb/300x450",
        "Жил да был в сказочном государстве большой зеленый великан по имени Шрэк. Жил он в гордом одиночестве в лесу, на болоте, которое считал своим. Но однажды злобный коротышка — лорд Фаркуад, правитель волшебного королевства, безжалостно согнал на Шрэково болото всех сказочных обитателей.\n" +
                "\n" +
                "И беспечной жизни зеленого великана пришел конец. Но лорд Фаркуад пообещал вернуть Шрэку болото, если великан добудет ему прекрасную принцессу Фиону, которая томится в неприступной башне, охраняемой огнедышащим драконом"
    ),
    Movie(
        "Тайна Коко",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1946459/6e11a16e-c9e7-491f-9162-01098a7d8dd9/600x900",
        "12-летний Мигель живёт в мексиканской деревушке в семье сапожников и тайно мечтает стать музыкантом. Тайно, потому что в его семье музыка считается проклятием. Когда-то его прапрадед оставил жену, прапрабабку Мигеля, ради мечты, которая теперь не даёт спокойно жить и его праправнуку. С тех пор музыкальная тема в семье стала табу. Мигель обнаруживает, что между ним и его любимым певцом Эрнесто де ла Крусом, ныне покойным, существует некая связь. Паренёк отправляется к своему кумиру в Страну Мёртвых, где встречает души предков. Мигель знакомится там с духом-скелетом по имени Гектор, который становится его проводником. Вдвоём они отправляются на поиски де ла Круса"
    ),
    Movie(
        "Как приручить дракона",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/4774061/1a920451-e765-41e9-81aa-78438e82abbc/600x900",
        "Вы узнаете историю подростка Иккинга, которому не слишком близки традиции его героического племени, много лет ведущего войну с драконами. Мир Иккинга переворачивается с ног на голову, когда он неожиданно встречает дракона Беззубика, который поможет ему и другим викингам увидеть привычный мир с совершенно другой стороны…"
    )
)

val musicals = mutableListOf(
    Movie(
        "Ла-Ла Ленд",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1900788/64c69e8a-5ee8-45f7-9f3f-e1940bca7036/600x900",
        "Это история любви старлетки, которая между прослушиваниями подает кофе состоявшимся кинозвездам, и фанатичного джазового музыканта, вынужденного подрабатывать в заштатных барах. Но пришедший к влюбленным успех начинает подтачивать их отношения"
    ),
    Movie(
        "Отверженные",
        "https://upload.wikimedia.org/wikipedia/ru/thumb/d/d9/Les_Miserables_2012_poster.jpg/211px-Les_Miserables_2012_poster.jpg",
        "Действие развивается в начале XIX столетия. Беглый каторжник Жан Вальжан, приговоренный к тюремному заключению, вынужден долгие годы скрываться от жестокого правосудия. Инспектор парижской полиции Жавер считает его поимку делом всей своей жизни. После смерти Фантины — женщины, за судьбу которой Жан Вальжан считал себя в ответе, — единственным близким ему человеком остается ее дочь Козетта. Ради счастья девушки Жан готов на все"
    ),
    Movie(
        "Бурлеск",
        "https://upload.wikimedia.org/wikipedia/ru/thumb/2/24/Burlesque_poster.jpg/220px-Burlesque_poster.jpg",
        "Али - молодая амбициозная девушка из маленького городка с чудесным голосом, совсем недавно потеряла своих родителей. Теперь никому не нужная, она отправляется в большой город Лос-Анджелес, где устраивается на работу у Тесс, хозяйки ночного клуба «Бурлеск». За короткое время она находит друзей, поклонников и любовь всей своей жизни. Но может ли сказка длиться вечно? Ведь немало людей завидует этой прекрасной танцовщице..."
    ),
    Movie(
        "Мамма MIA!",
        "https://b1.filmpro.ru/c/5443.jpg",
        "Молодая девушка Софи собирается выйти замуж и мечтает о том, чтобы церемония прошла по всем правилам. Она хочет пригласить на свадьбу своего отца, чтобы он отвел ее к алтарю. Но она не знает, кто он, так как ее мать Донна никогда не рассказывала о нем.\n" +
                "\n" +
                "Софи находит дневник матери, в котором та описывает отношения с тремя мужчинами. Софи решает отправить приглашения всем троим! Все самое интересное начинает происходить, когда на свадьбу приезжают гости…"
    ),
    Movie(
        "Чикаго",
        "https://upload.wikimedia.org/wikipedia/ru/2/20/Chicago_%28poster%29.jpg",
        "Рокси Харт мечтает о песнях и танцах и о том, как сравняться с самой Велмой Келли, примадонной водевиля. И Рокси действительно оказывается с Велмой в одном положении, когда несколько очень неправильных шагов приводят обеих на скамью подсудимых.\n" +
                "\n" +
                "В угрюмых стенах тюрьмы Рокси встречает легендарного адвоката Билли Флинна, который соглашается взяться за ее дело. Карьера Рокси резко идет вверх. Но хитроумная мисс Келли приготовила всем большой сюрприз «под занавес»..."
    ),
    Movie(
        "Величайший шоумен",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/6ed7202a-72d8-4225-a7ac-a0d46a5514a9/600x900",
        "Финеас Тейлор Барнум всегда мечтал войти в историю, но все его занятия не приносили ему удовольствия. И когда, казалось, весь мир обернулся против него, он решает пойти вслед за своей мечтой. Барнум создает завораживающее представление-сенсацию, которое стало рождением мирового шоу-бизнеса"
    ),
    Movie(
        "Тик-так... БУМ!",
        "https://avatars.mds.yandex.net/get-kinopoisk-image/1600647/e8aa799c-0783-43a1-a25f-9bfbeeb901eb/600x900",
        "1990 год. Молодой композитор Джон работает официантом в нью-йоркской забегаловке. Параллельно он пишет мюзикл «Супербия», который, как он рассчитывает, в будущем станет новым хитом Бродвея и позволит ему вырваться из нищеты. В жизни Джона всё непросто. Его девушка Сюзан устала ждать, пока бойфренд добьется успеха, а лучший друг оставил мечты и устроился на престижную работу в рекламном агентстве. Джону скоро исполнится 30 лет, и он начинает переживать, что впустую потратил все эти годы"
    )
)

val list = mutableListOf(
    MovieCategory("Comedy", comedy),
    MovieCategory("Drama", drama),
    MovieCategory("Anime", anime),
    MovieCategory("Animated films", mults),
    MovieCategory("Musicals", musicals)
)